{
  "about": "I'm a software engineer with a background in Web and Android application development. Currently, transitioning into Platform/DevOps engineering with a strong passion for solving complex problems and delivering value through innovative technology. After graduating with BSc. in Computer Science from the University of Hertfordshire in 2020, I joined Tata Consultancy Services in 2021. There, I worked as both a web developer and a mobile developer for multiple years before shifting my focus to backend and DevOps engineering. Most recently, I completed a Cloud/DevOps engineering training programme where I gained hands-on experience with tools such as Docker, Terraform, Kubernetes, Ansible and cloud platforms like AWS and Azure. As a part of the programme, I led the development and deployment of a real-world project which helped me strengthen my skills in infrastructure management and workflow automation. I'm always looking to learn, grow and stay up to date with emerging technologies. While I tend to be more on the introverted side, I appreciate and value thoughtful conversations and meaningful connections, so feel free to reach out!",
  "education": [
    {
      "level": "BSc. Honours Computer Science",
      "university": "University of Hertfordshire"
    },
    {
      "level": "HND Computing",
      "university": "Uxbridge College"
    }
  ],
  "experiences": [
    {
      "company": "Lafosse Academy",
      "role": "Tech Trainee (Cloud/DevOps)",
      "date": "March 2025 - June 2025",
      "description": "Completed a Cloud/DevOps deep-dive training programme gaining hands-on experience with infrastructure management, automation, and cloud technologies. Led a real-world project “a tool to view EV battery range with nearby EV charging stations” managing a GitHub Actions CI/CD pipeline to streamline code integration, testing, and deployment on AWS EKS. Automated scalable infrastructure provisioning using Terraform and Kubernetes. Integrated the Azure Maps SDK, and developed backend logic to fetch Azure Map auth tokens, isochrone data and EV charging stations across the UK."
    },
    {
      "company": "kchauk.com (Startup)",
      "role": "Freelance Developer",
      "date": "March 2024 - Aug 2024",
      "description": "Contributed to a web platform, a community-driven knowledge-based forum for the Nepalese community specifically targeted for international Nepalese students studying in the UK. Designed and built UI components using TailwindCSS, Context API, and React Query. Discussed and collaborated on solutions to deliver a dynamic forum where people can access and create knowledge on various topics."
    },
    {
      "company": "TATA Consultancy Services (Lloyds Banking Group)",
      "role": "Android Developer",
      "date": "Apr 2022 - Aug 2023",
      "description": "Implemented virtual card component on account overview section. Enhanced personalisation in the account overview quick links by replacing static links with dynamic links powered by the Real-Time Interaction Management (RTIM) API. Delivered a proof-of-concept (POC) project by implementing a suggestive search feature and contributed to the gradual migration from the Android View System to Jetpack Compose. Collaborated in an Agile Scrum environment, actively participating in shaping and refinement sessions with the Product Owner (PO), Business Analysts (BA), and cross-functional team members."
    },
    {
      "company": "TATA Consultancy Services (Graduate Scheme)",
      "role": "Junior Web Developer",
      "date": "Oct 2021 - Apr 2022",
      "description": "Completed the TCS graduate training programme focused on Java applications and test-driven development. Contributed to the TCS in-house help desk web application, a part of the larger cross-functional TCS Ultimatix team. Refactored approximately 60% of the frontend codebase to make it modular and reusable using React.js, CSS modules, Redux and React Query. Utilised Jest for unit testing. Wrote and maintained tests for the existing Spring Boot codebase using JUnit and Mockito."
    },
    {
      "company": "Corpus Ltd (Internship/Android Developer Work Experience)",
      "role": "Android Developer",
      "date": "May 2021 - Sep 2021",
      "description": "Contributed to Android app development as a part of a larger team for a healthcare solutions provider. Contributed in migrating the Java codebase to Kotlin, including replacing Android AsyncTask with Kotlin Coroutines. Implemented features using the MVVM architecture, leveraging Android ViewModel for booking system. Integrated Google Firebase real-time data synchronisation.Conducted unit tests using JUnit4 and MockK, static code coverage with JaCoco, and API testing with Postman."
    }
  ],
  "skillsets": {
    "languages": [
      "Java",
      "Python",
      "JavaScript/TypeScript",
      "HTML",
      "CSS",
      "bash",
      "C"
    ],
    "libraries_frameworks": [
      "React.js",
      "Node.js (Express)",
      "Tailwind CSS",
      "Jest",
      "JDK 17",
      "Spring Boot 3",
      "JPA/Hibernate",
      "JUnit",
      "Mockito",
      "FastAPI",
      "PyTest",
      "NumPy"
    ],
    "cloud_devops": ["Docker", "Kubernetes", "Terraform", "Ansible", "AWS"],
    "database_management": ["PostgreSQL", "SQLite", "MongoDB"],
    "versioncontrol_cicd_projectmanagement": [
      "Git",
      "GitHub",
      "GitHub Actions",
      "Agile Scrum",
      "Jira",
      "Confluence"
    ]
  },
  "hobbies": [
    "Outside of work, I enjoy playing guitar and occasionally write and record music.",
    "I also maintain fitness routine through running and find walks great to relax and clear my mind."
  ]
}
